["A couple bags of balloons, some left over decorations from my other daughters birthday, a few borrowed items from friends and family, and an hour or so of work, and they had a night to remember!! But the real question is, do you remember your first sleepover?!? 🤍🎈 #birthday #sleepover #party ", "who would you bring on a trip to the Bahamas 🌺 #honeymoon #travelbucketlist #thebahamas #caribbean #vacationinspo ", "Things to do in Cabo - Part 2! 🇲🇽 #cabo #cabosanlucas #traveltok #travelblogger  ", "All the details to our 4 day trip in Cabo. ✨ #fyp #whatwespent #cabo #cabosanlucas #travel ", "Let’s detox my son’s locs with me after 3 months #fypシ ", "5 Must-Do things in Costa Rica💫🌴🌺🦜 #travel #traveltiktok #adventure #costarica #costaricatravel #thingstodo #nature #travellife #buckelist #rainforest #monteverde #views #waterfall #hangingbridges #ziplining ", "land of adventures 🫶 #costaricatravel #costaricacool #dominicalcostarica #santateresacostarica #lafortunawaterfall #lafortunacostarica #nauyacawaterfalls ", "When you invute your white friends over for food @Chantelle Rose @Adro Shot It @laurenrosefarmer ", "When your white friends invite you in for food @Chantelle Rose @Adro Shot It @laurenrosefarmer ", "#piinkmango #blackfriday ", "i loved watching every single second of it 🎁❤️ #funfamilygames #funnygames #familytime #holidaytiktok #holidaygames #christmasgames #christmasfun #funchristmasgames #christmaspartygames", "Serving kristy at the end 😏 I personally love Penne Alla Vodka. It’s my favorite pasta dish. It’s a staple in my home and I wanted to share it with you! Let me know what your favorite pasta is, maybe I’ll make it soon!😉 Recipe Below. Penne Alla Vodka Recipe Ingredients  \t•\t1 lb bag Penne pasta \t•\t1 package of Prosciutto \t•\t3 Garlic Cloves (or more I love garlic I do 6) \t•\t1/2 cup heavy cream \t•\t3-4 Tablespoons, Titos Vodka (any brand works I use Tito’s) \t•\t1 28oz Can Whole Peeled Tomatoes \t•\t1 bunch of fresh Basil \t•\t3 Tablespoons Olive Oil \t•\t3 Tablespoons Unsalted Butter \t•\tMinced Parsley for garnish \t•\tGrated Parmesan for garnish \t•\tSalt & Pepper Instructions:  First, start a pot of boiling water for your pasta. While that comes to a boil, cube your prosciutto and mince the garlic and parsley. In a food processor, blitz your tomatoes (I like mine kind of chunky so I do a very quick 2-5 second blitz). In a medium-low pan, add your olive oil, prosciutto, and garlic. cook down until the garlic starts to slightly brown. Add basil bunch. Then add vodka, and turn heat down momentarily to avoid flare up then turn the heat back up to medium. This is normally a good time to drop your pasta in and cook according to box instructions. Once the vodka has reduced, add your blitzed tomato. Reduce the liquid until it’s thick enough to run your spoon through the middle and no liquid fills in. Add your salt & pepper to taste. Then add your heavy cream. Stir till combined. Add butter and stir. Add cooked pasta and serve with grated Parmesan and parsley for garnish.", "i love my bible so much #proverbs31woman #walkingbyfaith #shereadstruth #fyp #nandivuyiswa #CapCut ", "i remember watching this on disney channel & being like wow thats so many years away 🥲#greenscreen#suitelifeofzackandcody#suitelifeondeck#disney#disneychannel#disney100#justrealized#nostalgia#childhood#childhoodmemories#childhoodshows#fyp#fnaf #oliviarodrigoobsessed #oliviarodrigoguts#ilookjustlikemymommy#corgi#oliviathecorgi#christopherbriney#meangirlsmusical#fnafmovieedit#joshhutcherson #joshhutchersonedit#strangerthings5#trending#sixthemusicalbroadway#megasix#sixthemusical  ", "Pov: Life updates with all your long distance besties 🥹❤️  #girldinner #powerpointnight #teatime #tea #girlsnightideas #bffgoals ", "I know my friends be annoyed of me sometimes because I simply dont joke with certain things Inspo", "✨God Math✨ Pt. 2  🤣🙏#Godmath #christian #christiantiktok #fyp #foryou #trending  ", "Replying to @commandersfan5 The ending☠️😂 #guessthedrinkchallenge #toddlerchallenge #drinkchallange #toddlers #toddlersoftiktok #fyp ", "Do you know which cities these are?Captured here from: @parisfranceofficial@Barbora Ondrackova@Ｏｍｅｅｚｚｙ@ACQUIRED STYLE@Dr. Shna@Валерия Генне@yunobi@ximemontesdeoca@tiktokvenezia@axxtherese@Qing loves to travel@tiktokvenezia@Hannah Lawther@Macy-Leigh@Uday", "Literally every ounce of stress exits my body 🥲 ", "Life Hacks #freecomedy #themannii ", "#fyp #foryou ", "Back stretch and self release #backpainrelief #backcracks #trending #viral ", "WHO’S JOINING ME?! 🧡 #jesusgal #thejesuschallenge #jesusisking #relationshipwithgod #christiantiktok #youvebeenchallenged #jesusfollower #spendingtimewithgod #godsgirl ", "In my storefr0nt under “car must-haves” or DM me C444 for l!nks! #amazoncarfinds2023 #amazonorganization #amazonmusthaves2023 ", "Number 2 is my fav 😅🙌🏼 #travel #travelgadgets #travelproducts #airport #portable #gadgets #amazonfinds #justicebuys #", "Number 3 is my fav 🙌🏼😂 #amazonfinds #gadgets #justicebuys #productreview #tiktokmademebuyit #amazonfinds ", "Best selling carry on suitcase on Amazon! #founditonamazon #amazonbestseller #travelmusthaves ", "The ultimate travel hack for visiting Dubai… 👀 #dubai #uae #travelhacks #fyp ", "#stitch with @Christopher Cop #fyp ", "You will never find me sharing books promiting unhealthy relationships. The most important part of a romantic relationship to me is how the hero and heroine love the Lord. Because loving God above all else automatically creates a healthy, godly relationship. 🩷 #christianromancereader #christianromancebooktok #christianromancewelove #tawnisbookshelf #christianbooktok ", "cherish every moment 💗 #siblings  #sister #brother #bestfriend #fyp #bigsister ", "#tiktokfood #asmr ", "Where has this been all my life☺️", "Traveling in relationships should be this simple? We got a deal? #dating #travel #datingadvice #baecation ", "All this money spent on this trip you better not even close your eyes😭 #fyp #viral #trending #nigeria #nigeriantiktok #vacation #holiday ", "Full recipe in the comments 🫶🏻 #hairtiktok #hairtok #rosemarywater #hairgrowth #hairgrowthtips #healthyhair #longhair #hairgoals #hairtipsandtricks #hairinspo #haircare #rosemarywaterrecipe ", "Rosemary is one of my FAV ingredients for MASSIVE HAIR GROWTH@seeratsaini_ ", "Rosemary, amla & fenugreek is where its at ! Aint never switched up on my products stay consistent and track your progress youll be surprised 😌😘 #indianhairgrowthoils #indianhairgrowthsecrets #howtogrowlongnaturalhair #blackgirlsnaturalhair ", "Plot twist😂😂😂 #grandma #family #couplescomedy #fyp ", "i ain’t going no damn where in this heat", "Oven Barbecued Pork Ribs & And An Equally Amazing Home Made BBQ Sauce  #porkribs #barbecue #barbecuesauce #barbecuerub #fyp #foodtiktok #food #pork ", "you + your soulmate in Christ need one🤎 shop the link in our bio! #christiantiktok #jesus #jesuslovesyou #christian #motivation #god ", "As men whenever we do anything out of the norm that this broken world is use to we are told to man up or is told to stop acting fiminie, the truth is alot of people dont know what it feels like to feel secure within your self to the point you genuinly dont care what others have to say, because as long as it brings you true peace and happiness that’s all that matters. Self care is a never ending habit we should all try to put into our daily rituals to help take care of our mental and physical health. #selfcare #selfimprovement #skincare #howto #tipsformen #mentalhealth #fyp #tipsformen ", "Everytime bruh😭 #fyp #africantiktok #africanparents #burunditiktok🇧🇮 #brotherbernard #viral ", "That sums it up 😂 #christian #christiantiktok #prayer #fyp #foryou #funny ", "welcome to university 🫶 🙃 #collegelife #collegehumor #stemlife #stemmajor #stem #chemistry #organicchem #orgo #chemistrymajor #collegestudent #university #stemtok #chemistrytest #biochemistry #biologymajor #biologystudent #organicchem #organicchemistry #chemistrylab #study #studytok #student #studentlife #studentsbelike #study#CapCut ", "girls just wanna have fun, sleepover birthday party, sleepover, Birthday Party, Birthday Celebration, Birthday Decor, Balloon Decor, Balloon Decorations, Party Decorations, Sleepover Tent Party", "bahama, bahama vacation, bahama ghetto, the bahama islands, bahama travel warning, bahama beach, nassau bahama trip, vacation, Travel, bahama travel", "cabo san lucas, Things To Do In Cabo, Things To Do In Cabo San Lucas, kayak, Things To Do, Visiting Cabo San Lucas, Things To Do In Los Cabos, Visiting Cabo, Mexico, Kayak Boats, Explore Cabo San Lucas", "Cabo San Lucas, clear boat cabos, Travel, trips, Visiting Cabo San Lucas, Travel Vacation Trip, Visiting Cabo, Mexico, Day Trip, Explore Cabo San Lucas, Travel Vacation", "Locs Detoxing, retwisting locs, detox dreads, loc retwist, hair detox, dreadlock cleaning, dreadlock detox, dreadlocks, washing dreadlocks, How To Retwist Locs", "costa rica, Things To Do In Costa Rica, Monteverde, Costa Rica, La Fortuna In Costa Rica, travel tiktok, Travel, Bucket List Travel, Travel Adventures, Travel Life, Travel Destinations", "costa rica, Costa Rica Vacation, costa rica travel, costa rica all inclusive resorts, Costa Rica Itinerary, Things To Do In Costa Rica, dominical costa rica, costa rica nightlife, puerto rico vacation, Adventure Travel", NaN, NaN, NaN, "christmas games, thanksgiving games, christmas games idea, christmas party game, christmas games for family, christmas decor 2023, family games ideas, holiday party games, candy cane game, family games", "kristy sarah, desmond scott chef, Kristy Sarah Jehovah Witness, Pasta Dish, pasta, cooking videos, foodtiktok, Cooking Food Videos, Cooking Videos TikTok, Cooking Pasta", "she reads truth bible, the jesus bible, Bible, catholic bible, pink bible, she reads truth bible on sale, she reads truth bible controversy, bibles to buy on amazon, she reads truth bible vs the jesus bible, she reads truth bible black girl", NaN, NaN, NaN, NaN, "riss and quan, sour, Guess The Drink, the martin family, drinking water, sprite challenge, toddlerdrinkchallenge, guess thedrink challenge with kid, water, Juice Bottle", "luisito comunica paris, Paris Reality, Paris, paris rats, paris reality rats, paris instagram vs reality, reality vs instagram, social media versus reality, social media vs reality travel, Paris Expectation Vs Reality", NaN, NaN, NaN, "Shoulder Pain Relief, back stretches, Back Pain Relief, Stretch Exercises, Back Stretches For Pain, back cracks, Back Muscles, Back Exercise Tips, How To Get Rid Of Back Pain, Upper Back Stretches", NaN, "Amazon Car Must Haves, amazon must haves, car must haves, Amazon Finds Must Haves For Your Car, Car Amazon Finds, Amazon Items Must Haves, The Tote Bag Marc Jacobs, Car Finds, Marc Jacobs Tote Bag, Amazon", "rideable luggage, amazon finds, Amazon Finds Travel, luggage, Travel Gadgets, Travel Products, Travel Finds, Amazon Travel Luggage, Amazon, Gadgets Amazon", "amazon finds, human dog bed, top 15 amazon products, tiktok made me buy it, Electric Pot, tiktokmademebuyit, trolly dolly, smart trash can, Amazon, bed tent", "Feilario Luggage, Amazon Luggage Set, best carry on luggage, felario luggage amazon, carry on luggage, feilario luggage price, Travel Essentials, Amazon Carry On Luggage, Best Amazon Carry On Luggage, Amazon Travel Must Haves", "Dubai, dubai places to visit, Travel Hacks, boarding pass dubai, Travel Tips And Hacks, travel tips, Travel, Travel TikTok, Travel Hacks Flights, dubai tiktok videos", "jordan_the_stallion8, night showers, morning showers versus night showers, ShowerTok, Cold Showers At Night Before Bed, showers bathroom, cold showers, Shower Cleaning, Which Showers Are You Showering, showering twice a day", "francine rivers, Romance Book, #booktok, Romance, Books Of TikTok, christians, Reading Books, Favorite Books, Book Recs, Good Romance Books", NaN, "zach choi, cooking  videos, zach choi voice reveal, Food Cooking Videos, Mini Food Cooking, Food Recipes, tiktok food, food cooking, Foods Of TikTok, FoodTok", NaN, NaN, NaN, NaN, "Rosemary Hair Water, How To Make Rosemary Water, Rosemary Hair Oil, rice water for hair, rosemary water recipe, Rosemary Water, rosemary water before and after, rosemary oil recipe, Rosemary Oil Hair Growth, rosemary oil", NaN, "Comedy Video, family, granny funny videos, grandma and grandson, funny tiktok videos, grandma making up stuff, funny moments videos, cool grandma, Family Bonding, Grandma From The Visit", NaN, NaN, NaN, NaN, NaN, NaN, NaN]